In [1]:

import findspark
findspark.init()

In [2]:
import pyspark
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("Employee").getOrCreate()

In [4]:
data=[[101,"shreya",40000],[102,"priya",50000],[103,"tina",6000]]
df=spark.createDataFrame(data,["Id","name","salary"])

In [6]:
print(df)
print(type(df))

DataFrame[Id: bigint, name: string, salary: bigint]
<class 'pyspark.sql.dataframe.DataFrame'>

In [7]:
df.show()

+---+------+------+
| Id|  name|salary|
+---+------+------+
|101|shreya| 40000|
|102| priya| 50000|
|103|  tina|  6000|
+---+------+------+

In [11]:
#as pandas frame
df1=df.toPandas()
df1

    Id    name  salary
0  101  shreya   40000
1  102   priya   50000
2  103    tina    6000

In [10]:
print(type(df1))

<class 'pandas.core.frame.DataFrame'>

In [13]:
#col infor
df.columns

['Id', 'name', 'salary']

In [16]:
#rows 
df.count()

3

In [42]:
df2=spark.read.csv("F:\\Items1.csv",header=True)

In [43]:
df2

DataFrame[itemID: string, itemName: string, itemcost: string, supplier : string, grade: string]

In [44]:
df2.show()#shows oly top 20

+------+--------------+--------+---------+-----+
|itemID|      itemName|itemcost|supplier |grade|
+------+--------------+--------+---------+-----+
|     8|         chalk|      70|        X|    A|
|    12|        Pencil|      20|        Y|    B|
|    13|        Pencil|      70|        X|    A|
|    15|        Duster|      54|        Y|    C|
|     1|calculator    |     200|     null|    A|
|     2|          none|      20|     null|    C|
+------+--------------+--------+---------+-----+

In [45]:
frame=df2.head()
print(frame)
print(type(frame))

Row(itemID='8', itemName='chalk', itemcost='70', supplier ='X', grade='A')
<class 'pyspark.sql.types.Row'>

In [46]:
pdf=df2.toPandas()#shows all record

In [47]:
pdf

  itemID        itemName itemcost supplier  grade
0      8           chalk       70         X     A
1     12          Pencil       20         Y     B
2     13          Pencil       70         X     A
3     15          Duster       54         Y     C
4      1  calculator          200      None     A
5      2            none       20      None     C

In [49]:
#aggreation of data,grouping
#grade wise 
df2.groupBy("itemName").agg({'itemID':'count'}).show()

+--------------+-------------+
|      itemName|count(itemID)|
+--------------+-------------+
|         chalk|            1|
|          none|            1|
|        Duster|            1|
|calculator    |            1|
|        Pencil|            2|
+--------------+-------------+

In [51]:
dsp=spark.read.csv("f:\\loan prediction dataset in banking.csv",header=False)

In [52]:

dsp.show()

+--------+------+-------+----------+------------+-------------+---------------+-----------------+----------+----------------+--------------+-------------+-----------+
|     _c0|   _c1|    _c2|       _c3|         _c4|          _c5|            _c6|              _c7|       _c8|             _c9|          _c10|         _c11|       _c12|
+--------+------+-------+----------+------------+-------------+---------------+-----------------+----------+----------------+--------------+-------------+-----------+
| Loan_ID|Gender|Married|Dependents|   Education|Self_Employed|ApplicantIncome|CoapplicantIncome|LoanAmount|Loan_Amount_Term|Credit_History|Property_Area|Loan_Status|
|LP001002|  Male|     No|         0|    Graduate|           No|           5849|                0|      null|             360|             1|        Urban|          Y|
|LP001003|  Male|    Yes|         1|    Graduate|           No|           4583|             1508|       128|             360|             1|        Rural|          N|
|LP001005|  Male|    Yes|         0|    Graduate|          Yes|           3000|                0|        66|             360|             1|        Urban|          Y|
|LP001006|  Male|    Yes|         0|Not Graduate|           No|           2583|             2358|       120|             360|             1|        Urban|          Y|
|LP001008|  Male|     No|         0|    Graduate|           No|           6000|                0|       141|             360|             1|        Urban|          Y|
|LP001011|  Male|    Yes|         2|    Graduate|          Yes|           5417|             4196|       267|             360|             1|        Urban|          Y|
|LP001013|  Male|    Yes|         0|Not Graduate|           No|           2333|             1516|        95|             360|             1|        Urban|          Y|
|LP001014|  Male|    Yes|        3+|    Graduate|           No|           3036|             2504|       158|             360|             0|    Semiurban|          N|
|LP001018|  Male|    Yes|         2|    Graduate|           No|           4006|             1526|       168|             360|             1|        Urban|          Y|
|LP001020|  Male|    Yes|         1|    Graduate|           No|          12841|            10968|       349|             360|             1|    Semiurban|          N|
|LP001024|  Male|    Yes|         2|    Graduate|           No|           3200|              700|        70|             360|             1|        Urban|          Y|
|LP001027|  Male|    Yes|         2|    Graduate|         null|           2500|             1840|       109|             360|             1|        Urban|          Y|
|LP001028|  Male|    Yes|         2|    Graduate|           No|           3073|             8106|       200|             360|             1|        Urban|          Y|
|LP001029|  Male|     No|         0|    Graduate|           No|           1853|             2840|       114|             360|             1|        Rural|          N|
|LP001030|  Male|    Yes|         2|    Graduate|           No|           1299|             1086|        17|             120|             1|        Urban|          Y|
|LP001032|  Male|     No|         0|    Graduate|           No|           4950|                0|       125|             360|             1|        Urban|          Y|
|LP001034|  Male|     No|         1|Not Graduate|           No|           3596|                0|       100|             240|          null|        Urban|          Y|
|LP001036|Female|     No|         0|    Graduate|           No|           3510|                0|        76|             360|             0|        Urban|          N|
|LP001038|  Male|    Yes|         0|Not Graduate|           No|           4887|                0|       133|             360|             1|        Rural|          N|
+--------+------+-------+----------+------------+-------------+---------------+-----------------+----------+----------------+--------------+-------------+-----------+
only showing top 20 rows

In [54]:
dsp.groupBy("_c9").agg({'_c9':'count'}).show()

+----------------+----------+
|             _c9|count(_c9)|
+----------------+----------+
|            null|         0|
|Loan_Amount_Term|         1|
|             300|        13|
|             120|         3|
|              60|         2|
|             360|       512|
|             240|         4|
|             180|        44|
|              84|         4|
|             480|        15|
|              36|         2|
|              12|         1|
+----------------+----------+

In [55]:
df5=spark.read.csv("F:\\item_details.csv",header=True)

In [56]:
df5.show()

+------+---------+--------+--------+-----+
|itemid|itemname |itemcost|supplier|grade|
+------+---------+--------+--------+-----+
|     8|    chalk|   65.76|       X|    A|
|    12|   Pencil|       4|       Y|    B|
|    13|      Pen|      43|       X|    A|
|    15|   Duster|      54|       Y|    C|
|    23|    Scale|      10|    null|    A|
|    34|   Colors|      50|    null|    B|
+------+---------+--------+--------+-----+

In [57]:
df5.groupBy("supplier").agg({'supplier':'count'}).show()

+--------+---------------+
|supplier|count(supplier)|
+--------+---------------+
|    null|              0|
|       Y|              2|
|       X|              2|
+--------+---------------+

In [61]:
from pyspark.sql import functions as f
df5.groupBy("supplier").agg(f.max('itemcost'),f.sum('itemcost'),f.avg('itemcost')).show()

+--------+-------------+-------------+-------------+
|supplier|max(itemcost)|sum(itemcost)|avg(itemcost)|
+--------+-------------+-------------+-------------+
|    null|           50|         60.0|         30.0|
|       X|        65.76|       108.76|        54.38|
|       Y|           54|         58.0|         29.0|
+--------+-------------+-------------+-------------+

In [63]:
dff=df5
df5.rdd.id()

244

In [64]:
dff.rdd.id()

244

In [69]:
df6=df5.withColumn('billss',df5['itemcost']+df5['itemID'])

In [70]:
df6.show()

+------+---------+--------+--------+-----+------+
|itemid|itemname |itemcost|supplier|grade|billss|
+------+---------+--------+--------+-----+------+
|     8|    chalk|   65.76|       X|    A| 73.76|
|    12|   Pencil|       4|       Y|    B|  16.0|
|    13|      Pen|      43|       X|    A|  56.0|
|    15|   Duster|      54|       Y|    C|  69.0|
|    23|    Scale|      10|    null|    A|  33.0|
|    34|   Colors|      50|    null|    B|  84.0|
+------+---------+--------+--------+-----+------+

In [71]:
rowlist=df6.collect()
print(rowlist)

[Row(itemid='8', itemname ='chalk', itemcost='65.76', supplier='X', grade='A', billss=73.76), Row(itemid='12', itemname ='Pencil', itemcost='4', supplier='Y', grade='B', billss=16.0), Row(itemid='13', itemname ='Pen', itemcost='43', supplier='X', grade='A', billss=56.0), Row(itemid='15', itemname ='Duster', itemcost='54', supplier='Y', grade='C', billss=69.0), Row(itemid='23', itemname ='Scale', itemcost='10', supplier=None, grade='A', billss=33.0), Row(itemid='34', itemname ='Colors', itemcost='50', supplier=None, grade='B', billss=84.0)]